app/Models/MData.php

    public function saveData($data)
    {
        $query = $this->db->table('tbl_fitrah')->insert($data);
---
INSERT INTO `tbl_fitrah` (`nik`, `nama`, `no_telpon`, `jenis_zakat`, `jumlah_jiwa`, `nominal`) VALUES ('232313879786', 'aldi', '0965542346788', 'infaq', '5', '50.000.000')

    public function saveEditData($data,$nik)
    {
        $query = $this->db->table('tbl_fitrah')
        ->where('nik',$nik)
        ->update($data);
---
UPDATE `tbl_fitrah` SET `nik` = '2147483647', `nama` = 'aldi', `no_telpon` = '0965542346788', `jenis_zakat` = 'infaq', `jumlah_jiwa` = '5', `nominal` = '50000000'
WHERE `nik` = '2147483647'

    public function hapusData($nik)
    {
        $query = $this->db->table('tbl_fitrah')
        ->where('nik',$nik)
        ->delete();
---
DELETE FROM `tbl_fitrah`
WHERE `nik` = '123478796'